src/billing-benefits/azext_billing_benefits/tests/latest/recordings/test_billing_benefits_validate_purchase.yaml

interactions:
- request:
    body: '{"benefits": [{"properties": {"appliedScopeType": "Shared", "billingPlan":
      "P1M", "billingScopeId": "eef82110-c91b-4395-9420-fcfcbefc5a47", "commitment":
      {"amount": 10.0, "currencyCode": "USD", "grain": "Hourly"}, "displayName": "name1",
      "term": "P1Y"}, "sku": {"name": "Compute_Savings_Plan"}}]}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - billing-benefits validate-purchase
      Connection:
      - keep-alive
      Content-Length:
      - '296'
      Content-Type:
      - application/json
      ParameterSetName:
      - --benefits
      User-Agent:
      - AZURECLI/2.43.0 (AAZ) azsdk-python-core/1.24.0 Python/3.10.7 (Windows-10-10.0.19045-SP0)
    method: POST
    uri: https://management.azure.com/providers/Microsoft.BillingBenefits/validate?api-version=2022-11-01
  response:
    body:
      string: '{"benefits":[{"valid":true}]}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '29'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 16 Dec 2022 03:24:24 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      server:
      - Microsoft-IIS/10.0
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding,Accept-Encoding
      x-aspnet-version:
      - 4.0.30319
      x-content-type-options:
      - nosniff
      x-ms-ratelimit-remaining-tenant-writes:
      - '1199'
      x-ms-test:
      - '{"contact":"yunga","scenarios":"time-scale:17520,days-until-time-stop:365,CSZ,Inv-v7,crs-vnext,GtmRiPurchase","retention":"3/16/2023
        3:24:24 AM"}'
    status:
      code: 200
      message: OK
version: 1
